---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetNumberOfUnits
source: html/680cc814-86da-f836-7928-2a6e5d0c8ec8.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.GetNumberOfUnits Method

returns number of possible units

## Syntax (C#)
```csharp
public int GetNumberOfUnits()
```